app/controllers/api/annotations_controller.rb

SELECT "annotations".* FROM "annotations"
---
    def index
        @annotations = Annotation.all

SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @annotation = Annotation.find_by(id: params[:id])

INSERT INTO "annotations" ("body", "upvote_count", "passage_id", "annotator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "delete this nephew"], ["upvote_count", 100], ["passage_id", 1], ["annotator_id", 1], ["created_at", "2020-04-30 23:21:48.554693"], ["updated_at", "2020-04-30 23:21:48.554693"]]
---
    def create
        @annotation = Annotation.new(annotation_params)
        if @annotation.save

SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "annotations" SET "body" = $1, "updated_at" = $2 WHERE "annotations"."id" = $3  [["body", "no"], ["updated_at", "2020-04-30 23:25:42.342257"], ["id", 3]]
---
    def update
        @annotation = Annotation.find_by(id: params[:id])
        if @annotation
            @annotation.update(annotation_params)

SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "annotations" WHERE "annotations"."id" = $1  [["id", 3]]
---
    def destroy
        @annotation = Annotation.find_by(id: params[:id])
        if @annotation
            @annotation.destroy