app/controllers/api/passages_controller.rb

SELECT "passages".* FROM "passages"
---
    def index
        @passages = Passage.all

SELECT  "passages".* FROM "passages" WHERE "passages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @passage = Passage.find(params[:id])

INSERT INTO "passages" ("title", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "10000 Angry Dwarves"], ["author", "Ben Folds"], ["body", "Check the papers"], ["created_at", "2020-04-29 18:24:32.382842"], ["updated_at", "2020-04-29 18:24:32.382842"]]
---
    def create
        @passage = Passage.new(passage_params)
        if @passage.save

SELECT  "passages".* FROM "passages" WHERE "passages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "passages" SET "title" = $1, "author" = $2, "updated_at" = $3 WHERE "passages"."id" = $4  [["title", "Stacy's Mom"], ["author", "Edgar Potato"], ["updated_at", "2020-04-29 18:21:04.249156"], ["id", 1]]
---
    def update
        @passage = Passage.find(params[:id])
        if @passage.update(passage_params)

SELECT  "passages".* FROM "passages" WHERE "passages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "passages" WHERE "passages"."id" = $1  [["id", 5]]
SELECT "passages".* FROM "passages"
---
    def destroy
        @passage = Passage.find(params[:id])
        if @passage
            @passage.destroy
        end
        #this works, but there is probably a better way -> redirect to index controller?
        @passages = Passage.all