app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(params.require(:user).permit(:username, :password, :email))
        if @user.save